{"maximumSentences":7,"searchTerm":"Iron Maiden","prefix":"Who is","sourceContentOriginal":"Iron Maiden are an English heavy metal band formed in Leyton, East London, in 1975 by bassist and primary songwriter Steve Harris. The band's discography has grown to 39 albums, including 16 studio albums, 12 live albums, four EPs, and seven compilations.\nPioneers of the new wave of British heavy metal, Iron Maiden achieved initial success during the early 1980s. After several line-up changes, the band went on to release a series of UK and US platinum and gold albums, including 1982's The Number of the Beast, 1983's Piece of Mind, 1984's Powerslave, 1985's live release Live After Death, 1986's Somewhere in Time, and 1988's Seventh Son of a Seventh Son. Since the return of lead vocalist Bruce Dickinson and guitarist Adrian Smith in 1999, the band has undergone a resurgence in popularity, with a series of new albums and tours. Their 2010 studio offering, The Final Frontier, peaked at No. 1 in 28 countries and received widespread critical acclaim. The sixteenth studio album, The Book of Souls, was released on 4 September 2015 and debuted at number one in the album charts of 43 countries.Iron Maiden are considered one of the most influential and successful heavy metal bands in history, with The Sunday Times reporting in 2017 that the band have sold over 100 million copies of their albums worldwide, despite little radio or television support. The band won the Ivor Novello Award for international achievement in 2002. As of October 2013, the band have played over 2000 live shows throughout their career. For 40 years the band have been supported by their famous mascot, \"Eddie\", who has appeared on almost all of their album and single covers, as well as in their live shows.\n\n\n== History ==\n\n\n=== Early years (1975–1978) ===\n\nIron Maiden were formed on Christmas Day, 25 December 1975 by bassist Steve Harris shortly after he left his previous group, Smiler. Harris attributed the band's name to a film adaptation of The Man in the Iron Mask from the novel by Alexandre Dumas, the title of which reminded him of the iron maiden torture device. After months of rehearsal, Iron Maiden made their debut at St. Nicks Hall in Poplar on 1 May 1976, before taking up a semi-residency at the Cart and Horses Pub in Maryland, Stratford.The original line-up was short-lived, with vocalist Paul Day being the first casualty as, according to Harris, he lacked \"energy or charisma on stage\". He was replaced by Dennis Wilcock, a Kiss fan who used make-up and fake blood during live performances. Wilcock's friend, Dave Murray, was invited to join, much to the dismay of the band's guitarists Dave Sullivan and Terry Rance. Their frustration led Harris to temporarily disband Iron Maiden in 1976, though the group reformed soon after with Murray as the sole guitarist. Harris and Murray remain the band's longest-standing members and have performed on all of their releases.\n\nIron Maiden recruited yet another guitarist in 1977, Bob Sawyer, who was sacked for embarrassing the band on stage by pretending to play guitar with his teeth. Tension ensued again, causing a rift between Murray and Wilcock, who convinced Harris to fire Murray, as well as original drummer Ron Matthews. A new line-up was put together, including future Cutting Crew member Tony Moore on keyboards, Terry Wapram on guitar, and drummer Barry Purkis (better known today as Thunderstick). A poor performance at the Bridgehouse, a pub located in Canning Town, in November 1977 was the line-up's first and only concert. Afterwards, Iron Maiden fired Purkis and replaced him with Doug Sampson. At the same time, Moore was asked to leave as Harris decided that keyboards did not suit the band's sound. A few months later, Dennis Wilcock decided to leave Iron Maiden to form his own band, V1, and Dave Murray was immediately reinstated. As he preferred to be the band's sole guitarist, Wapram disapproved of Murray's return, and was also dismissed.Harris, Murray, and Sampson spent the summer and autumn of 1978 rehearsing while they searched for a singer to complete the band's new line-up. A chance meeting at the Red Lion pub in Leytonstone in November 1978 evolved into a successful audition for vocalist Paul Di'Anno. Steve Harris stated, \"There's sort of a quality in Paul's voice, a raspiness in his voice, or whatever you want to call it, that just gave it this great edge.\" At this time, Murray would typically act as their sole guitarist, with Harris commenting, \"Davey was so good he could do a lot of it on his own. The plan was always to get a second guitarist in, but finding one that could match Davey was really difficult.\"\n\n\n=== Record contract and early releases (1978–1981) ===\n\nOn New Year's Eve 1978, Iron Maiden recorded a demo, consisting of four songs, at Spaceward Studios in Cambridge. Hoping that the recording would help them secure more gigs, the band presented a copy to Neal Kay, then managing a heavy metal club called \"Bandwagon Heavy Metal Soundhouse\", located in Kingsbury Circle, northwest London. Upon hearing the tape, Kay began playing the demo regularly at the Bandwagon, and one of the songs, \"Prowler\", eventually went to No. 1 in the Soundhouse charts, which were published weekly in Sounds magazine. A copy was also acquired by Rod Smallwood, who soon became the band's manager, and, as Iron Maiden's popularity increased, they released the demo on their own record label as The Soundhouse Tapes, named after the club. Featuring only three tracks (one song, \"Strange World\", was excluded as the band were unsatisfied with its production) all five thousand copies were sold out within weeks.In December 1979, the band secured a major record deal with EMI, and asked Dave Murray's childhood friend, Adrian Smith of Urchin, to join the group as their second guitarist. Due to his commitment to Urchin, Smith declined and Dennis Stratton was hired instead. Shortly afterwards, Doug Sampson left due to health issues, and was replaced by ex-Samson drummer Clive Burr at Stratton's suggestion on 26 December 1979. Iron Maiden's first appearance on an album was on the Metal for Muthas compilation (released on 15 February 1980) with two early versions of \"Sanctuary\" and \"Wrathchild\". The release led to an ensuing tour which featured several other bands linked with the new wave of British heavy metal.\n\nIron Maiden released their self-titled album in 1980, which debuted at No. 4 in the UK Albums Chart. In addition to the title track (a live version of which would be one of the first music videos aired on MTV), the album includes other early favourites such as \"Running Free\", \"Transylvania\", \"Phantom of the Opera\", and \"Sanctuary\" – which was not on the original UK release, but appeared on the US version and subsequent remasters. The band embarked on a headline tour of the UK, before opening for Kiss on their 1980 Unmasked Tour's European leg as well as supporting Judas Priest on select dates. Iron Maiden also appeared, to much acclaim, at the Reading Festival 1980. They were second to top of the bill on the Saturday, with UFO headlining. After the Kiss tour, Dennis Stratton was dismissed from the band as a result of creative and personal differences, and was replaced by Adrian Smith in October 1980.\nIn 1981, Iron Maiden released their second studio album, Killers. Containing many tracks written prior to their debut release, only two new songs were written for the record: \"Prodigal Son\" and \"Murders in the Rue Morgue\" (the latter's title was taken from the short story by Edgar Allan Poe). Unsatisfied with the production on their debut album, the band hired veteran producer Martin Birch, who would go on to work for Iron Maiden until his retirement in 1992. The record was followed by the band's first world tour, which included their debut performance in the United States, opening for Judas Priest at The Aladdin Casino in Las Vegas.\n\n\n=== Success (1981–1985) ===\n\nBy 1981, Paul Di'Anno was demonstrating increasingly self-destructive behaviour, particularly due to his drug usage, about which Di'Anno comments, \"it wasn't just that I was snorting a bit of coke, though; I was just going for it non-stop, 24 hours a day, every day ... the band had commitments piling up that went on for months, years, and I just couldn't see my way to the end of it. I knew I'd never last the whole tour. It was too much.\" With his performances waning, Di'Anno was immediately dismissed following the Killer World Tour, at which point the band had already selected his replacement.After a meeting with Rod Smallwood at the Reading Festival, Bruce Dickinson, previously of Samson, auditioned for Iron Maiden in September 1981 and was immediately hired.  The following month, Dickinson went out on the road with the band on a small headlining tour in Italy, as well as a one-off show at the Rainbow Theatre in the UK. For the last show, and in anticipation of their forthcoming album, the band played \"Children of the Damned\" and \"22 Acacia Avenue\", introducing fans to the sound towards which they were progressing.In 1982, Iron Maiden released their third studio album, The Number of the Beast, which gave the band their first UK Albums Chart No. 1 record and additionally became a Top Ten hit in many other countries. At the time, Dickinson was in the midst of legal difficulties with Samson's management, and was not permitted to add his name to any of the songwriting credits, although he still made what he described as a \"moral contribution\" to \"Children of the Damned\", \"The Prisoner\" and \"Run to the Hills\". For the second time the band embarked on a world tour, dubbed The Beast on the Road, during which they visited North America, Japan, Australia, and Europe, including a headline appearance at the Reading Festival. A new and hugely successful chapter in Iron Maiden's future was cemented; in 2010 The New York Times reported that the album had sold over 14 million copies worldwide.The Beast on the Road's US leg proved controversial when an American conservative political lobbying group claimed that Iron Maiden were Satanic because of the new album's title track, to the point where a group of Christian activists destroyed Iron Maiden records as a protest against the band. In recent years, Dickinson stated that the band treated this as \"silliness\", and that the demonstrations in fact gave them \"loads of publicity\".\n\nIn December 1982, drummer Clive Burr was fired from the band and replaced by Nicko McBrain, who previously played for Trust. Although Harris stated that his dismissal took place because his live performances were affected by offstage activities, Burr objected to this, and claimed that he was unfairly ousted from the band. Soon afterwards, the band journeyed for the first time to The Bahamas to record the first of three consecutive albums at Compass Point Studios. In 1983, they released their fourth studio album, Piece of Mind, which reached the No. 3 spot in the UK, and was the band's debut in the North American charts, reaching No. 70 on the Billboard 200. Piece of Mind includes the successful singles, \"The Trooper\" and \"Flight of Icarus\", the latter of which being particularly notable as one of the band's few songs to gain substantial airplay in the US.Soon after the success of Piece of Mind and its supporting tour, the band released their fifth studio album, Powerslave, on 9 September 1984. The album features the singles \"2 Minutes to Midnight\", \"Aces High\", as well as \"Rime of The Ancient Mariner\", based on Samuel Taylor Coleridge's poem of the same name, and running over 13 minutes in length.The tour, following the album, dubbed the World Slavery Tour, was the band's largest to date, and consisted of 193 shows in 28 countries over 13 months, playing to an estimated 3,500,000 people. Many shows were played back-to-back in the same city, such as in Long Beach, California, where the band played four consecutive concerts. Their first live album, Live After Death, was recorded, which became a critical and commercial success, peaking at No. 4 in the UK. Iron Maiden also made their debut appearance in South America, where they co-headlined (with Queen) the Rock in Rio festival to an estimated 300,000 in attendance. The tour was physically gruelling for the band, who demanded six months off when it ended (although this was later reduced to four months). This was the first substantial break in the group's history, including the cancellation of a proposed supporting tour for the new live album, with Bruce Dickinson threatening to quit unless the tour ended.\n\n\n=== Experimentation (1986–1989) ===\n\nReturning from their time off, the band adopted a different style for their 1986 studio album, entitled Somewhere in Time, featuring, for the first time in the band's history, synthesised bass and guitars to add textures and layers to the sound. The release charted well across the world, particularly with the single \"Wasted Years\", but notably included no writing credits from Dickinson, whose material was rejected by the rest of the band. While Dickinson was focused on his own music, guitarist Adrian Smith, who typically collaborated with the vocalist, was \"left to [his] own devices\" and began writing songs on his own, coming up with \"Wasted Years\", \"Sea of Madness\", and \"Stranger in a Strange Land\", the last of which would be the album's second single.The experimentation evident on Somewhere in Time continued on their next album, entitled Seventh Son of a Seventh Son, which was released in 1988. A concept album, based on the 1987 novel Seventh Son by Orson Scott Card, would be the band's first record to include keyboards, performed by Harris and Smith, as opposed to guitar synthesisers on the previous release. After his contributions were not used for Somewhere in Time, Dickinson's enthusiasm was renewed as his ideas were accepted for this album. Another popular release, it became Iron Maiden's second album to hit No. 1 in the UK charts, although it only achieved a Gold certification in the US, in contrast to its four predecessors.During the following tour, the band headlined the Monsters of Rock festival at Donington Park for the first time on 20 August 1988, playing to the largest crowd in the festival's history, with an estimated 107,000 in attendance. Also included on the bill were Kiss, David Lee Roth, Megadeth, Guns N' Roses, and Helloween. The festival was marred, however, by the deaths of two fans in a crowd-surge during the aforementioned Guns N' Roses performance; the following year's festival was cancelled as a result. The tour concluded with several headline shows in the UK in November and December 1988, with the concerts at the NEC Arena, Birmingham recorded for a live video, entitled Maiden England. Throughout the tour, Harris' bass technician, Michael Kenney, provided live keyboards. Kenney has acted as the band's live keyboard player ever since, also performing on the band's four following albums before Harris took over as the group's sole studio keyboardist from 2000's Brave New World.\n\n\n=== Upheaval (1989–1994) ===\n\nDuring another break in 1989, guitarist Adrian Smith released a solo album with his band ASAP, entitled Silver and Gold, and vocalist Bruce Dickinson began work on a solo album with former Gillan guitarist Janick Gers, releasing Tattooed Millionaire in 1990, followed by a tour. At the same time, to mark the band's ten-year recording anniversary, Iron Maiden released a compilation collection, The First Ten Years, a series of ten CDs and double 12-inch singles. Between 24 February and 28 April 1990, the individual parts were released one-by-one, each containing two of Iron Maiden's singles, including the original B-sides.\nSoon afterwards, Iron Maiden regrouped to work on a new studio record. During the pre-production stages, Adrian Smith left the band due to differences with Steve Harris, regarding the direction the band should be taking, disagreeing with the \"stripped down\" style that they were leaning towards. Janick Gers, having worked on Dickinson's solo project, was chosen to replace Smith, and became the band's first new member in seven years. The album, No Prayer for the Dying, was released in October 1990, and contained \"Bring Your Daughter... to the Slaughter\", the band's first (and to date, only) UK Singles Chart No. 1, originally recorded by Dickinson's solo outfit for the soundtrack to A Nightmare on Elm Street 5: The Dream Child. The song was banned by the BBC and only a 90-second live clip on Top of the Pops was shown.\nAfter another tour and some more time off, the band recorded their next studio album, Fear of the Dark, which was released in 1992 and included the stand-out title track, which is now a regular fixture in the band's concert setlists. Achieving their third No. 1 in the UK albums chart, the disc also featured the No. 2 single \"Be Quick or Be Dead\" and the No. 21 single \"From Here to Eternity\". The album featured the first songwriting by Gers, and no collaboration at all between Harris and Dickinson on songs. The extensive worldwide tour that followed included their first ever Latin American leg (after a single concert during the World Slavery Tour), and headlining the Monsters of Rock festivals in seven European countries. Iron Maiden's second performance at Donington Park, to an audience of 68,500 (the attendance was capped after the incident in 1988), was filmed for the audio and video release, Live at Donington, and featured a guest appearance by Adrian Smith, who joined the band to perform \"Running Free\".In 1993, Dickinson left the band to further pursue his solo career, but agreed to remain for a farewell tour and two live albums (later re-released in one package). The first, A Real Live One, featured songs from 1986 to 1992, and was released in March 1993. The second, A Real Dead One, featured songs from 1980 to 1984, and was released after Dickinson had left the band. The tour did not go well, with Steve Harris claiming that Dickinson would only perform properly for high-profile shows, and that at several concerts, he would only mumble into the microphone. Dickinson denied that he was under-performing, stating that it was impossible to \"make like Mr Happy Face if the vibe wasn't right\", saying that news of his exit from the band had prevented any chance of a good atmosphere during the tour. He played his farewell show with Iron Maiden on 28 August 1993, which was filmed, broadcast by the BBC, and released on video under the name Raising Hell.\n\n\n=== Blaze Bayley era, The X Factor and Virtual XI (1994–1999) ===\n\nIn 1994, the band listened to hundreds of tapes sent in by vocalists before convincing Blaze Bayley, formerly of the band Wolfsbane, who had supported Iron Maiden in 1990, to audition for them. Harris' preferred choice from the outset, Bayley had a different vocal style from his predecessor, which ultimately received a mixed reception among fans.After a two-year hiatus (as well as a three-year hiatus from studio releases – a record for the band at the time), Iron Maiden returned in 1995. Releasing their next studio album, The X Factor, the band had their lowest chart position since 1981 for an album in the UK (debuting at No. 8), although it would go on to win Album of the Year awards in France and Germany.  The record included the 11-minute epic \"Sign of the Cross\", the band's longest song since \"Rime of the Ancient Mariner\", as well as the singles, \"Man on the Edge\", based on the film Falling Down, and \"Lord of the Flies\", based on the novel of the same name. The release is notable for its \"dark\" tone, inspired by Steve Harris' divorce. The band toured for the rest of 1995 and 1996, playing for the first time in Israel and South Africa, and ending in the Americas. After the tour, Iron Maiden released a compilation album, Best of the Beast. The band's first compilation, it included a new single, \"Virus\", in which the lyrics attack the critics, who had recently written off the band.In 1998, Iron Maiden released Virtual XI, whose chart scores were the band's lowest to date, failing to score one million worldwide sales for the first time in the band's history. The album peaked at No. 16 in the UK; the band's lowest for a new studio record.  At the same time, Steve Harris assisted in remastering the band's entire discography, up to and including Live at Donington (which was given a mainstream release for the first time).Bayley's tenure in Iron Maiden ended in January 1999 when he was asked to leave during a band meeting. The dismissal took place due to issues Bayley had experienced with his voice during the Virtual XI World Tour, although Janick Gers stated that this was partly the band's fault for forcing him to perform songs pitched outside the natural range of his voice.\n\n\n=== Return of Dickinson and Smith, Brave New World (1999–2002) ===\n\nWhile the group were considering a replacement for Bayley, Rod Smallwood convinced Steve Harris to invite Bruce Dickinson back into the band. Although Harris admitted that he \"wasn't really into it\" at first, he then thought, \"'Well, if the change happens, who should we get?' The thing is, we know Bruce and we know what he's capable of, and you think, 'Well, better the devil you know.' I mean, we got on well professionally for, like, eleven years, and so ... after I thought about it, I didn't really have a problem with it.\"The band entered into talks with Dickinson, who agreed to rejoin during a meeting in Brighton in January 1999, along with guitarist Adrian Smith, who was telephoned a few hours later. With Gers, Smith's replacement, remaining, Iron Maiden now had a three-guitar line-up, and embarked on a hugely successful reunion tour. Dubbed The Ed Hunter Tour, it tied in with the band's newly released greatest hits collection, Ed Hunter, whose track listing was decided by a poll on the group's website, and also contained a computer game of the same name starring the band's mascot.One of Dickinson's primary concerns on rejoining the group \"was whether we would in fact be making a real state-of-the-art record and not just a comeback album,\" which eventually took the form of 2000's Brave New World. Having disliked the results from Harris' personal studio, Barnyard Studios located on his property in Essex, which had been used for the last four Iron Maiden studio albums, the band recorded the new release at Guillaume Tell Studios in Paris, France in November 1999 with producer Kevin Shirley. Thematic influences continued with \"The Wicker Man\" – based on the 1973 British cult film of the same name – and \"Brave New World\" – title taken from the Aldous Huxley novel of the same name. The album furthered the more progressive and melodic sound present in some earlier recordings, with elaborate song structures and keyboard orchestration.The world tour that followed consisted of well over 100 dates and culminated on 19 January 2001 in a show at the Rock in Rio festival in Brazil, where Iron Maiden played to an audience of around 250,000. While the performance was being produced for a CD and DVD release in March 2002, under the name Rock in Rio, the band took a year off from touring, during which they played three consecutive shows at Brixton Academy in aid of former drummer Clive Burr, who had recently announced that he had been diagnosed with multiple sclerosis. The band performed two further concerts for Burr's MS Trust Fund charity in 2005, and 2007, before his death in 2013.\n\n\n=== Dance of Death and A Matter of Life and Death (2003–2007) ===\n\nFollowing their Give Me Ed... 'Til I'm Dead Tour in the summer of 2003, Iron Maiden released Dance of Death, their thirteenth studio album, which was met by worldwide critical and commercial success. Produced by Kevin Shirley, now the band's regular producer, many critics also felt that this release matched up to their earlier efforts, such as Killers, Piece of Mind and The Number of the Beast. As usual, historical, and literary references were present, with \"Montségur\" in particular being about the Cathar stronghold conquered in 1244, and \"Paschendale\" relating to the significant battle which took place during the First World War. During the following tour, the band's performance at Westfalenhalle, in Dortmund, Germany, was recorded and released in August 2005 as a live album and DVD, entitled Death on the Road.In 2005, the band announced the Eddie Rips Up the World Tour, which, tying in with their 2004 DVD entitled The History of Iron Maiden – Part 1: The Early Days, only featured material from their first four albums. As part of this celebration of their earlier years, \"The Number of the Beast\" single was re-released and went straight to No. 3 in the UK Chart. The tour included many headlining stadium and festival dates, including a performance at Ullevi Stadium in Sweden to an audience of almost 60,000. This concert was also broadcast live on satellite television all over Europe to approximately 60 million viewers. Following this run of European shows, the band co-headlined the US festival tour, Ozzfest, with Black Sabbath, their final performance at which earned international press coverage after their show was sabotaged by singer Ozzy Osbourne's family, who took offence to Dickinson's remarks against reality-TV. The band completed the tour by headlining the Reading and Leeds Festivals on the 26–28 August, and the RDS Stadium in Ireland on 31 August. For the second time, the band played a charity show for The Clive Burr MS Trust Fund, which took place at the Hammersmith Apollo. The same year, the band were inducted into the Hollywood RockWalk in Sunset Boulevard, Los Angeles.\n\nAt the end of 2005, Iron Maiden began work on A Matter of Life and Death, their fourteenth studio album, released in autumn 2006. While not a concept album, war and religion are recurring themes in the lyrics, as well as in the cover artwork. The release was a critical and commercial success, earning the band their first top ten in the Billboard 200 and receiving the Album of the Year award at the 2006 Classic Rock Roll of Honour Awards. A supporting tour followed, during which they played the album in its entirety; response to this was mixed.The second part of the \"A Matter of Life and Death\" tour, which took place in 2007, was dubbed \"A Matter of the Beast\" to celebrate the 25th anniversary of The Number of the Beast album, and included appearances at several major festivals worldwide. The tour opened in the Middle East with the band's first performance in Dubai at the Dubai Desert Rock Festival, after which they played to over 30,000 people at the Bangalore Palace Grounds, marking the first concert by any major heavy metal band in the Indian sub-continent. The band went on to play a string of European dates, including an appearance at Download Festival, their fourth headline performance at Donington Park, to approximately 80,000 people. On 24 June they ended the tour with a performance at London's Brixton Academy in aid of The Clive Burr MS Trust fund.\n\n\n=== Somewhere Back in Time World Tour and Flight 666 (2007–2009) ===\n\nOn 5 September 2007, the band announced their Somewhere Back in Time World Tour, which tied in with the DVD release of their Live After Death album. The setlist for the tour consisted of successes from the 1980s, with a specific emphasis on the Powerslave era for set design. The first part of the tour, commencing in Mumbai, India on 1 February 2008, consisted of 24 concerts in 21 cities, travelling nearly 50,000 miles in the band's own chartered aeroplane, named \"Ed Force One\". They played their first ever concerts in Costa Rica and Colombia and their first shows in Australia and Puerto Rico since 1992.\n\nThe tour led to the release of a new compilation album, entitled Somewhere Back in Time, which included a selection of tracks from their 1980 eponymous debut to 1988's Seventh Son of a Seventh Son, as well as several live versions from Live After Death.The Somewhere Back in Time World Tour continued with two further legs in the US and Europe in the summer of 2008, during which the band used a more expansive stage-set, including further elements of the original Live After Death show. With the sole UK concert taking place at Twickenham Stadium, this would be the first time the band would headline a stadium in their own country. The three 2008 legs of the tour were remarkably successful; it was the second highest-grossing tour of the year for a British artist.The last part of the tour took place in February and March 2009, with the band, once again, using \"Ed Force One\". The final leg included the band's first ever appearances in Peru and Ecuador, as well as their return to Venezuela and New Zealand after 17 years. The band also played another show in India (their third in the country within a span of 2 years) at the Rock in India festival to a crowd of 20,000. At their concert in São Paulo on 15 March, Dickinson announced on stage that it was the largest non-festival show of their career, with an overall attendance of 63,000 people. The final leg ended in Florida on 2 April after which the band took a break. Overall, the tour reportedly had an attendance of over two million people worldwide over both years. At the 2009 Brit Awards, Iron Maiden won the award for best British live act. Voted for by the public, the band reportedly won by a landslide.On 20 January 2009, the band announced that they were to release a full-length documentary film in select cinemas on 21 April 2009. Entitled Iron Maiden: Flight 666, it was filmed during the first part of the Somewhere Back in Time World Tour between February and March 2008. Flight 666 was co-produced by Banger Productions and was distributed in cinemas by Arts Alliance Media and EMI, with D&E Entertainment sub-distributing in the US. The film went on to have a Blu-ray, DVD, and CD release in May and June, topping the music DVD charts in 22 countries.\n\n\n=== The Final Frontier and Maiden England World Tour (2010–2014) ===\n\nFollowing announcements that the band had begun composition of new material and booked studio time in early 2010 with Kevin Shirley producing, The Final Frontier was announced on 4 March. The album, the band's fifteenth, was released on 16 August, garnering critical acclaim and the band's greatest commercial success in their history, reaching No. 1 in twenty-eight countries worldwide. Although Steve Harris had been quoted in the past as claiming that the band would only produce fifteen studio releases, band members have since confirmed that there will be at least one further record.\n\nThe album's supporting tour saw the band perform 98 shows across the globe to an estimated audience of over 2 million, including their first visits to Singapore, Indonesia, and South Korea, before concluding in London on 6 August 2011. As the tour's 2010 leg preceded The Final Frontier's release, the band made \"El Dorado\" available as a free download on 8 June, which would go on to win the award for Best Metal Performance at the 2011 Grammy Awards on 13 February 2011. It was the band's first win following two previous Grammy nominations (\"Fear of the Dark\" in 1994 and \"The Wicker Man\" in 2001).On 15 March, a new compilation to accompany 2009's Somewhere Back in Time was announced. Entitled From Fear to Eternity, the original release date was set at 23 May, but was later delayed to 6 June. The double disc set covers the period 1990–2010 (the band's most recent eight studio albums), and, as on Somewhere Back in Time, live versions with Bruce Dickinson were included in place of original recordings which featured other vocalists, in this case Blaze Bayley.\nIn a press release regarding From Fear to Eternity, band manager Rod Smallwood revealed that Iron Maiden would release a new concert video to DVD in 2011, filmed in Santiago, Chile and Buenos Aires, Argentina during The Final Frontier World Tour. On 17 January 2012, the band announced that the new release, entitled En Vivo!, based on footage from the Chile concert, would be made available worldwide on CD, LP, DVD, and Blu-ray on 26 March, except for the United States and Canada (where it was released on 27 March). In addition to the concert footage, the video release includes an 88-minute tour documentary, entitled Behind The Beast, containing interviews with the band and their crew. In December 2012, one song from the release (\"Blood Brothers\") was nominated for a Grammy Award for Best Hard Rock/Metal Performance at the 2013 Grammy Awards.On 15 February 2012, the band announced the Maiden England World Tour 2012–14, which was based around the video of the same name. The tour commenced in North America in the summer of 2012 and was followed by further dates in 2013 and 2014, which included the band's record-breaking fifth headline performance at Donington Park, their first show at the newly built national stadium in Stockholm, a return to the Rock in Rio festival in Brazil, and their debut appearance in Paraguay. In August 2012, Steve Harris stated that the Maiden England video would be re-issued in 2013, with a release date later set for 25 March 2013 in DVD, CD, and LP formats under the title Maiden England '88.\n\n\n=== The Book of Souls and Legacy of the Beast (2015–present) ===\n\nFollowing confirmation from the group that 2010's The Final Frontier would not be their last album, Bruce Dickinson revealed plans for a sixteenth studio record in July 2013, with a potential release date in 2015. In February 2015, drummer Nicko McBrain revealed that a new album had been completed, although the release was put on hold as Dickinson was recovering from treatment for a cancerous tumour found on his tongue. On 15 May, after Dickinson was cleared for activities, manager Rod Smallwood confirmed that the album would be released in 2015, although the band would not tour until 2016 to allow Dickinson to continue recuperating.  On 18 June 2015, the band's website announced its title, The Book of Souls, and confirmed a release date of 4 September 2015. It is the band's first original studio album not to be issued by EMI outside North America, following Parlophone's acquisition by Warner Music Group in 2013. It was a critical and commercial success, becoming the band's fifth UK No. 1 album.\n\nThe new record was recorded at Guillaume Tell Studios, Paris, which they had previously used for 2000's Brave New World, with regular producer Kevin Shirley in late summer 2014. With a total run time of 92 minutes, it is the group's first double studio album. In addition, the release's closing song, \"Empire of the Clouds\", penned by Dickinson, surpassed \"Rime of the Ancient Mariner\" (from 1984's Powerslave) as Iron Maiden's longest song, at 18 minutes in length. A music video for the song \"Speed of Light\" was issued on 14 August.In February 2016, the band embarked on The Book of Souls World Tour, which saw them play concerts in 35 countries in North and South America, Asia, Australasia, Africa, and Europe, including their first ever performances in China, El Salvador, and Lithuania. As with 2008–09's Somewhere Back in Time World Tour and 2010–11's The Final Frontier World Tour, the group travelled in a customised aeroplane, flown by Dickinson and nicknamed \"Ed Force One\", although they used a Boeing 747-400 jumbo jet. The band completed the tour in 2017 with further European and North American shows. On 20 September 2017, The Book of Souls: Live Chapter was announced. Recorded throughout The Book of Souls World Tour, it was released on 17 November 2017.In the summer of 2016, the group launched a mobile game, Iron Maiden: Legacy of the Beast and a pinball game with the same name in 2018. Inspired by the game's title, the band would undertake the Legacy of the Beast World Tour, commencing in Europe in 2018, with North and South American shows following in 2019. On 23 September 2019, the band announced they would play the 2020 Belsonic Festival in Belfast and a headline show at Donington Park, England, as part of 2020 Download Festival. On 7 November 2019, they announced Australian shows throughout May 2020 joined by Killswitch Engage.\n\n\n== Image and legacy ==\nIron Maiden were ranked No. 24 in VH1's \"100 Greatest Artists of Hard Rock\", No. 4 in MTV's \"Top 10 Greatest Heavy Metal Bands of All Time\" and No. 3 in VH1 Classic's \"Top 20 Metal Bands\".  The band also won the Ivor Novello Award for international achievement in 2002 and were inducted into the Hollywood RockWalk whilst touring in the US in 2005.Iron Maiden frequently use the slogan \"Up the Irons\" in their disc liner notes, and the phrase can also be seen on several T-shirts officially licensed by the band. It is a paraphrase of \"Up the Hammers\", the phrase which refers to the London football club, West Ham United, of which founder Steve Harris is a fan.\n\nIron Maiden's mascot, Eddie, is a perennial fixture in the band's science fiction and horror-influenced album cover art, as well as in live shows. Originally a papier-mâché mask incorporated in their backdrop which would squirt fake blood during their live shows, the name would be transferred to the character featured in the band's debut album cover, created by Derek Riggs. Eddie was painted exclusively by Riggs until 1992, at which point the band began using artwork from numerous other artists as well, including Melvyn Grant. Eddie is also featured in the band's first-person shooter video game, Ed Hunter, as well as their mobile role-playing game, Iron Maiden: Legacy of the Beast, in addition to numerous T-shirts, posters and other band-related merchandise. In 2008, he was awarded the \"Icon Award\" at the Metal Hammer Golden Gods, while Gibson.com describes him as \"the most recognisable metal icon in the world and one of the most versatile too\".Iron Maiden's distinct logo has adorned all of the band's releases since their debut, 1979's The Soundhouse Tapes EP. The typeface originates with Vic Fair's poster design for the 1976 science fiction film, The Man Who Fell to Earth, also used by Gordon Giltrap, although Steve Harris claims that he designed it himself, using his abilities as an architectural draughtsman. The song \"Always Look on the Bright Side of Life\" (from Monty Python’s Life of Brian) is a staple at their concerts, where the recording is played after the final encore.In May 2019, the band filed a $2 million lawsuit against video game company 3D Realms for infringing on their trademark via the planned release of a game called Ion Maiden, which the band claims “is nearly identical to the Iron Maiden trademark in appearance, sound and overall commercial impression.” The suit further accuses 3D Realms of causing “confusion among consumers” by depicting a skull icon similar to the band's Eddie mascot and that Ion Maiden is similar to the band's own Legacy of the Beast video game.\n\n\n=== Influence on other artists ===\nAccording to Guitar World, Iron Maiden's music has \"influenced generations of newer metal acts, from legends like Metallica to current stars like Avenged Sevenfold,\" with Metallica drummer Lars Ulrich commenting that he has \"always had an incredible amount of respect and admiration for them.\" Kerry King of Slayer stated that \"they meant so much to [him] in their early days\" and Scott Ian of Anthrax said that \"they had a major impact on [his] life.\"M. Shadows of Avenged Sevenfold stated that Iron Maiden \"are by far the best live band in the world and their music is timeless\", while Trivium singer Matt Heafy comments that \"without Iron Maiden, Trivium surely wouldn't exist\". Slipknot and Stone Sour frontman Corey Taylor said that \"Steve Harris does more with four fingers than I've ever seen anybody do. And Bruce Dickinson? Dude! To me, he was the quintessential old-school heavy metal singer. He could hit notes that were just sick, and he was a great showman. Everything made me a fan. And there wasn't a dude that I hung out with that wasn't trying to draw Eddie on their schoolbooks\", while their music also helped Jesper Strömblad of In Flames to pioneer the melodic death metal genre, stating that he had wanted to combine death metal with Iron Maiden's melodic guitar sounds.Other heavy metal artists who cite the band as an influence include Chris Jericho, a WWE wrestler and lead singer of Fozzy, Cam Pipes, lead vocalist of 3 Inches of Blood, Vitaly Dubinin, bassist of Aria, Mikael Åkerfeldt, guitarist and lead vocalist of Opeth, and X Japan drummer Yoshiki and former guitarist hide. Both current and former Dream Theater members John Petrucci, John Myung, and Mike Portnoy have stated that Iron Maiden were one of their biggest influences when their band first formed.\n\n\n=== Appearance in media ===\nThe band's name has been mentioned prominently in several songs, such as the singles \"Teenage Dirtbag\" by Wheatus, \"Back to the 80's\" by Danish dance-pop band Aqua. and \"Fat Lip\" by Sum 41. Iron Maiden have also been referenced in Weezer's \"Heart Songs\" (from their 2008 self-titled \"Red\" album), Blues Traveler's \"Psycho Joe\" (from 1997's Straight on till Morning), and NOFX's \"Eddie, Bruce and Paul\" (from their 2009 album Coaster), which Sputnikmusic describes as \"a humorous retelling of Paul DiAnno's departure\".In 2008, Kerrang! released Maiden Heaven: A Tribute to Iron Maiden, an album composed of Iron Maiden cover songs performed by Metallica, Machine Head, Dream Theater, Trivium, Coheed and Cambria, Avenged Sevenfold, and other groups influenced by the band. In 2010, Maiden uniteD, an acoustic tribute band consisting of members of Ayreon, Threshold and Within Temptation, released Mind the Acoustic Pieces, a re-interpretation of the entire Piece of Mind album. Many other Iron Maiden cover albums exist (each featuring various artists), including piano, electro, string quartet and hip-hop tributes.Iron Maiden songs have been featured in the soundtracks of several video games, including Carmageddon 2, Grand Theft Auto: Vice City, Grand Theft Auto: Episodes from Liberty City, Grand Theft Auto IV: The Lost and Damned, Tony Hawk's Pro Skater 4, SSX on Tour and Madden NFL 10. Their music also appears in the Guitar Hero and Rock Band series of rhythmic video games. Iron Maiden songs have also appeared in films, such as Phenomena (entitled Creepers in the US), and Murder by Numbers; while MTV's animated duo Beavis and Butt-Head have commented favourably on the band several times.Transformers author Bill Forster is an avowed Iron Maiden fan and made several Iron Maiden references, including song lyrics and the phrase \"Up the Irons\" in his books, including The Ark series and The AllSpark Almanac series.\n\n\n=== Claims of Satanic references ===\nIn 1982, the band released one of their most popular, controversial and acclaimed albums, The Number of the Beast. The artwork and title track led to Christian groups in the United States branding the band as Satanists, encouraging people to destroy copies of the release. The band's manager, Rod Smallwood, later commented that Christians initially burnt the records, but later decided to destroy them with hammers through fear of breathing in the melting vinyl's fumes. The protests were not restricted to the US, with Christian organisations preventing Iron Maiden from performing in Chile in 1992.Contrary to the accusations, the band have always denied the notion that they are Satanists, with lead vocalist, Bruce Dickinson, doing so on-stage in the Live After Death concert video. Steve Harris has since commented that, \"It was mad. They completely got the wrong end of the stick. They obviously hadn't read the lyrics. They just wanted to believe all that rubbish about us being Satanists.\" Harris has also stated that \"The Number of the Beast\" song was inspired by a nightmare he had after watching Damien: Omen II, and also influenced by Robert Burns' Tam o' Shanter. Furthermore, the band's drummer, Nicko McBrain, has been a born-again Christian since 1999.\n\n\n=== Ed Force One ===\n\nFor their Somewhere Back in Time World Tour in 2008 and 2009, Iron Maiden commissioned an Astraeus Airlines Boeing 757 as transport. The aeroplane was converted into a combi configuration, which enabled it to carry the band, their crew and stage production, thereby allowing the group to perform in countries which were previously deemed unreachable logistically. It was also repainted with a special Iron Maiden livery, which the airline decided to retain after receiving positive feedback from customers.\n\nThe aircraft, named \"Ed Force One\" after a competition on the band's website, was flown by Dickinson, as he was also a commercial airline pilot for Astraeus, and plays a major role in the award-winning documentary, Iron Maiden: Flight 666, which was released in cinemas in 42 countries in April 2009. A different aeroplane (registered G-STRX) was used for The Final Frontier World Tour in 2011 with altered livery, adopting the artwork of The Final Frontier album, and features heavily in the 2012 documentary \"Behind the Beast\". For The Book of Souls World Tour in 2016, the band upgraded to an ex-Air France Boeing 747-400 jumbo jet, supplied by Air Atlanta Icelandic (registered TF-AAK) and customised by Volga-Dnepr Gulf, which allows for more space without the aircraft having to undergo a significant conversion to carry their equipment.\n\n\n== Musical style and influences ==\nSteve Harris, Iron Maiden's bassist and primary songwriter, has stated that his influences include Black Sabbath, Deep Purple, Led Zeppelin, Uriah Heep, Pink Floyd, Genesis, Yes, Jethro Tull, Thin Lizzy, UFO, Queen and Wishbone Ash. In 2010 Harris stated, \"I think if anyone wants to understand Maiden's early thing, in particular the harmony guitars, all they have to do is listen to Wishbone Ash's Argus album. Thin Lizzy too, but not as much. And then we wanted to have a bit of a prog thing thrown in as well, because I was really into bands like Genesis and Jethro Tull. So you combine all that with the heavy riffs and the speed, and you've got it.\" In 2004, Harris explained that the band's \"heaviness\" was inspired by \"Black Sabbath and Deep Purple with a bit of Zeppelin thrown in.\" On top of this, Harris developed his own playing style, which guitarist Janick Gers describes as \"more like a rhythm guitar,\" cited as responsible for the band's galloping style, heard in such songs as \"The Trooper\" and \"Run to the Hills.\"The band's guitarists, Dave Murray, Adrian Smith, and Janick Gers, each have their own individual influences and playing style. Dave Murray is known for his legato technique which, he claims, \"evolved naturally. I'd heard Jimi Hendrix using legato when I was growing up, and I liked that style of playing.\" Stating that he \"was inspired by blues rock rather than metal,\" Adrian Smith was influenced by Johnny Winter and Pat Travers, leading to him becoming a \"melodic player.\" Janick Gers, on the other hand, prefers a more improvised style, largely inspired by Ritchie Blackmore, which he claims is in contrast to Smith's \"rhythmic\" sound.Singer Bruce Dickinson, who typically works in collaboration with guitarist Adrian Smith, has an operatic vocal style, inspired by Arthur Brown, Peter Hammill, Ian Anderson and Ian Gillan, and is often considered to be one of the best heavy metal vocalists of all time. Although Nicko McBrain has only received one writing credit, on the Dance of Death album, Harris often relies on him while developing songs. Adrian Smith commented, \"Steve loves playing with him. [They] used to work for hours going over these bass and drum patterns.\"Throughout their career, the band's style has remained largely unchanged, in spite of the addition of guitar synthesisers on 1986's Somewhere in Time, keyboards on 1988's Seventh Son of a Seventh Son, and an attempt to return to the \"stripped down\" production of their earlier material on 1990's No Prayer for the Dying. In recent years, however, the band have begun using more progressive elements in their songs, which Steve Harris describes as not progressive \"in the modern sense, but like Dream Theater, more in a 70s way\". According to Harris, Seventh Son of a Seventh Son was the band's first album which was \"more progressive\", while they would only return to this style from 1995's The X Factor, which he states is \"like an extension of Seventh Son..., in the sense of the progressive element to it\". The development contrasts with the band's raw-sounding earlier material, which AllMusic states was \"clearly drawing from elements of punk rock\", although Harris firmly denies this.\n\n\n== Band members ==\n\n\n== Discography ==\n\nIron Maiden (1980)\nKillers (1981)\nThe Number of the Beast (1982)\nPiece of Mind (1983)\nPowerslave (1984)\nSomewhere in Time (1986)\nSeventh Son of a Seventh Son (1988)\nNo Prayer for the Dying (1990)\nFear of the Dark (1992)\nThe X Factor (1995)\nVirtual XI (1998)\nBrave New World (2000)\nDance of Death (2003)\nA Matter of Life and Death (2006)\nThe Final Frontier (2010)\nThe Book of Souls (2015)\n\n\n== Concert tours ==\n\n\n== Awards and nominations ==\n\n\n== See also ==\nList of artists who reached number one on the UK Singles Chart\nList of new wave of British heavy metal bands\nList of bands and artists from England\nList of songs recorded by Iron Maiden\nList of Iron Maiden tribute albums\nThe Iron Maidens\n\n\n== Citations ==\n\n\n== References ==\n\n\n== Bibliography ==\nBushell, Gary (1985). Iron Maiden: Running Free. Hal Leonard Corp. ISBN 978-0-946-39184-4.\nDaniels, Neil (2016). Iron Maiden - Updated Edition: The Ultimate Illustrated History of the Beast. Voyageur Press. ISBN 978-0-760-35167-3.\nDi'Anno, Paul (2010). The Beast: Singing With Iron Maiden―The Drugs, the Groupies . . . the Whole Story. John Blake. ISBN 978-1-844-54884-2.\nDickinson, Bruce (2017). What Does This Button Do?: An Autobiography. Dey Street Books. ISBN 978-0-062-46813-0.\nHalfin, Ross (2008). Iron Maiden. Vision On. ISBN 978-1-846-09445-3.\nMcMurtrie, John (2013). Iron Maiden: On Board Flight 666. Orion Publishing. ISBN 978-1-409-14136-5.\nPopoff, Martin (2013). 2 Minutes to Midnight: An Iron Maiden Day-by-Day. Backbeat Books. ISBN 978-1-617-13565-1.\nPrato, Greg (2015). Iron Maiden: '80 '81. self-published. ISBN 978-1-508-53638-3.\n\n\n== External links ==\nOfficial website","sourceContentSanitized":"Iron Maiden are an English heavy metal band formed in Leyton, East London, in 1975 by bassist and primary songwriter Steve Harris. The band's discography has grown to 39 albums, including 16 studio albums, 12 live albums, four EPs, and seven compilations. Pioneers of the new wave of British heavy metal, Iron Maiden achieved initial success during the early 1980s. After several line-up changes, the band went on to release a series of UK and US platinum and gold albums, including 1982's The Number of the Beast, 1983's Piece of Mind, 1984's Powerslave, 1985's live release Live After Death, 1986's Somewhere in Time, and 1988's Seventh Son of a Seventh Son. Since the return of lead vocalist Bruce Dickinson and guitarist Adrian Smith in 1999, the band has undergone a resurgence in popularity, with a series of new albums and tours. Their 2010 studio offering, The Final Frontier, peaked at No. 1 in 28 countries and received widespread critical acclaim. The sixteenth studio album, The Book of Souls, was released on 4 September 2015 and debuted at number one in the album charts of 43 countries.Iron Maiden are considered one of the most influential and successful heavy metal bands in history, with The Sunday Times reporting in 2017 that the band have sold over 100 million copies of their albums worldwide, despite little radio or television support. The band won the Ivor Novello Award for international achievement in 2002. As of October 2013, the band have played over 2000 live shows throughout their career. For 40 years the band have been supported by their famous mascot, \"Eddie\", who has appeared on almost all of their album and single covers, as well as in their live shows. Iron Maiden were formed on Christmas Day, 25 December 1975 by bassist Steve Harris shortly after he left his previous group, Smiler. Harris attributed the band's name to a film adaptation of The Man in the Iron Mask from the novel by Alexandre Dumas, the title of which reminded him of the iron maiden torture device. After months of rehearsal, Iron Maiden made their debut at St. Nicks Hall in Poplar on 1 May 1976, before taking up a semi-residency at the Cart and Horses Pub in Maryland, Stratford.The original line-up was short-lived, with vocalist Paul Day being the first casualty as, according to Harris, he lacked \"energy or charisma on stage\". He was replaced by Dennis Wilcock, a Kiss fan who used make-up and fake blood during live performances. Wilcock's friend, Dave Murray, was invited to join, much to the dismay of the band's guitarists Dave Sullivan and Terry Rance. Their frustration led Harris to temporarily disband Iron Maiden in 1976, though the group reformed soon after with Murray as the sole guitarist. Harris and Murray remain the band's longest-standing members and have performed on all of their releases. Iron Maiden recruited yet another guitarist in 1977, Bob Sawyer, who was sacked for embarrassing the band on stage by pretending to play guitar with his teeth. Tension ensued again, causing a rift between Murray and Wilcock, who convinced Harris to fire Murray, as well as original drummer Ron Matthews. A new line-up was put together, including future Cutting Crew member Tony Moore on keyboards, Terry Wapram on guitar, and drummer Barry Purkis . A poor performance at the Bridgehouse, a pub located in Canning Town, in November 1977 was the line-up's first and only concert. Afterwards, Iron Maiden fired Purkis and replaced him with Doug Sampson. At the same time, Moore was asked to leave as Harris decided that keyboards did not suit the band's sound. A few months later, Dennis Wilcock decided to leave Iron Maiden to form his own band, V1, and Dave Murray was immediately reinstated. As he preferred to be the band's sole guitarist, Wapram disapproved of Murray's return, and was also dismissed.Harris, Murray, and Sampson spent the summer and autumn of 1978 rehearsing while they searched for a singer to complete the band's new line-up. A chance meeting at the Red Lion pub in Leytonstone in November 1978 evolved into a successful audition for vocalist Paul Di'Anno. Steve Harris stated, \"There's sort of a quality in Paul's voice, a raspiness in his voice, or whatever you want to call it, that just gave it this great edge.\" At this time, Murray would typically act as their sole guitarist, with Harris commenting, \"Davey was so good he could do a lot of it on his own. The plan was always to get a second guitarist in, but finding one that could match Davey was really difficult.\" On New Year's Eve 1978, Iron Maiden recorded a demo, consisting of four songs, at Spaceward Studios in Cambridge. Hoping that the recording would help them secure more gigs, the band presented a copy to Neal Kay, then managing a heavy metal club called \"Bandwagon Heavy Metal Soundhouse\", located in Kingsbury Circle, northwest London. Upon hearing the tape, Kay began playing the demo regularly at the Bandwagon, and one of the songs, \"Prowler\", eventually went to No. 1 in the Soundhouse charts, which were published weekly in Sounds magazine. A copy was also acquired by Rod Smallwood, who soon became the band's manager, and, as Iron Maiden's popularity increased, they released the demo on their own record label as The Soundhouse Tapes, named after the club. Featuring only three tracks all five thousand copies were sold out within weeks.In December 1979, the band secured a major record deal with EMI, and asked Dave Murray's childhood friend, Adrian Smith of Urchin, to join the group as their second guitarist. Due to his commitment to Urchin, Smith declined and Dennis Stratton was hired instead. Shortly afterwards, Doug Sampson left due to health issues, and was replaced by ex-Samson drummer Clive Burr at Stratton's suggestion on 26 December 1979. Iron Maiden's first appearance on an album was on the Metal for Muthas compilation with two early versions of \"Sanctuary\" and \"Wrathchild\". The release led to an ensuing tour which featured several other bands linked with the new wave of British heavy metal. Iron Maiden released their self-titled album in 1980, which debuted at No. 4 in the UK Albums Chart. In addition to the title track , the album includes other early favourites such as \"Running Free\", \"Transylvania\", \"Phantom of the Opera\", and \"Sanctuary\" – which was not on the original UK release, but appeared on the US version and subsequent remasters. The band embarked on a headline tour of the UK, before opening for Kiss on their 1980 Unmasked Tour's European leg as well as supporting Judas Priest on select dates. Iron Maiden also appeared, to much acclaim, at the Reading Festival 1980. They were second to top of the bill on the Saturday, with UFO headlining. After the Kiss tour, Dennis Stratton was dismissed from the band as a result of creative and personal differences, and was replaced by Adrian Smith in October 1980. In 1981, Iron Maiden released their second studio album, Killers. Containing many tracks written prior to their debut release, only two new songs were written for the record: \"Prodigal Son\" and \"Murders in the Rue Morgue\" . Unsatisfied with the production on their debut album, the band hired veteran producer Martin Birch, who would go on to work for Iron Maiden until his retirement in 1992. The record was followed by the band's first world tour, which included their debut performance in the United States, opening for Judas Priest at The Aladdin Casino in Las Vegas. By 1981, Paul Di'Anno was demonstrating increasingly self-destructive behaviour, particularly due to his drug usage, about which Di'Anno comments, \"it wasn't just that I was snorting a bit of coke, though; I was just going for it non-stop, 24 hours a day, every day ... the band had commitments piling up that went on for months, years, and I just couldn't see my way to the end of it. I knew I'd never last the whole tour. It was too much.\" With his performances waning, Di'Anno was immediately dismissed following the Killer World Tour, at which point the band had already selected his replacement.After a meeting with Rod Smallwood at the Reading Festival, Bruce Dickinson, previously of Samson, auditioned for Iron Maiden in September 1981 and was immediately hired. The following month, Dickinson went out on the road with the band on a small headlining tour in Italy, as well as a one-off show at the Rainbow Theatre in the UK. For the last show, and in anticipation of their forthcoming album, the band played \"Children of the Damned\" and \"22 Acacia Avenue\", introducing fans to the sound towards which they were progressing.In 1982, Iron Maiden released their third studio album, The Number of the Beast, which gave the band their first UK Albums Chart No. 1 record and additionally became a Top Ten hit in many other countries. At the time, Dickinson was in the midst of legal difficulties with Samson's management, and was not permitted to add his name to any of the songwriting credits, although he still made what he described as a \"moral contribution\" to \"Children of the Damned\", \"The Prisoner\" and \"Run to the Hills\". For the second time the band embarked on a world tour, dubbed The Beast on the Road, during which they visited North America, Japan, Australia, and Europe, including a headline appearance at the Reading Festival. A new and hugely successful chapter in Iron Maiden's future was cemented; in 2010 The New York Times reported that the album had sold over 14 million copies worldwide.The Beast on the Road's US leg proved controversial when an American conservative political lobbying group claimed that Iron Maiden were Satanic because of the new album's title track, to the point where a group of Christian activists destroyed Iron Maiden records as a protest against the band. In recent years, Dickinson stated that the band treated this as \"silliness\", and that the demonstrations in fact gave them \"loads of publicity\". In December 1982, drummer Clive Burr was fired from the band and replaced by Nicko McBrain, who previously played for Trust. Although Harris stated that his dismissal took place because his live performances were affected by offstage activities, Burr objected to this, and claimed that he was unfairly ousted from the band. Soon afterwards, the band journeyed for the first time to The Bahamas to record the first of three consecutive albums at Compass Point Studios. In 1983, they released their fourth studio album, Piece of Mind, which reached the No. 3 spot in the UK, and was the band's debut in the North American charts, reaching No. 70 on the Billboard 200. Piece of Mind includes the successful singles, \"The Trooper\" and \"Flight of Icarus\", the latter of which being particularly notable as one of the band's few songs to gain substantial airplay in the US.Soon after the success of Piece of Mind and its supporting tour, the band released their fifth studio album, Powerslave, on 9 September 1984. The album features the singles \"2 Minutes to Midnight\", \"Aces High\", as well as \"Rime of The Ancient Mariner\", based on Samuel Taylor Coleridge's poem of the same name, and running over 13 minutes in length.The tour, following the album, dubbed the World Slavery Tour, was the band's largest to date, and consisted of 193 shows in 28 countries over 13 months, playing to an estimated 3,500,000 people. Many shows were played back-to-back in the same city, such as in Long Beach, California, where the band played four consecutive concerts. Their first live album, Live After Death, was recorded, which became a critical and commercial success, peaking at No. 4 in the UK. Iron Maiden also made their debut appearance in South America, where they co-headlined the Rock in Rio festival to an estimated 300,000 in attendance. The tour was physically gruelling for the band, who demanded six months off when it ended . This was the first substantial break in the group's history, including the cancellation of a proposed supporting tour for the new live album, with Bruce Dickinson threatening to quit unless the tour ended. Returning from their time off, the band adopted a different style for their 1986 studio album, entitled Somewhere in Time, featuring, for the first time in the band's history, synthesised bass and guitars to add textures and layers to the sound. The release charted well across the world, particularly with the single \"Wasted Years\", but notably included no writing credits from Dickinson, whose material was rejected by the rest of the band. While Dickinson was focused on his own music, guitarist Adrian Smith, who typically collaborated with the vocalist, was \"left to [his] own devices\" and began writing songs on his own, coming up with \"Wasted Years\", \"Sea of Madness\", and \"Stranger in a Strange Land\", the last of which would be the album's second single.The experimentation evident on Somewhere in Time continued on their next album, entitled Seventh Son of a Seventh Son, which was released in 1988. A concept album, based on the 1987 novel Seventh Son by Orson Scott Card, would be the band's first record to include keyboards, performed by Harris and Smith, as opposed to guitar synthesisers on the previous release. After his contributions were not used for Somewhere in Time, Dickinson's enthusiasm was renewed as his ideas were accepted for this album. Another popular release, it became Iron Maiden's second album to hit No. 1 in the UK charts, although it only achieved a Gold certification in the US, in contrast to its four predecessors.During the following tour, the band headlined the Monsters of Rock festival at Donington Park for the first time on 20 August 1988, playing to the largest crowd in the festival's history, with an estimated 107,000 in attendance. Also included on the bill were Kiss, David Lee Roth, Megadeth, Guns N' Roses, and Helloween. The festival was marred, however, by the deaths of two fans in a crowd-surge during the aforementioned Guns N' Roses performance; the following year's festival was cancelled as a result. The tour concluded with several headline shows in the UK in November and December 1988, with the concerts at the NEC Arena, Birmingham recorded for a live video, entitled Maiden England. Throughout the tour, Harris' bass technician, Michael Kenney, provided live keyboards. Kenney has acted as the band's live keyboard player ever since, also performing on the band's four following albums before Harris took over as the group's sole studio keyboardist from 2000's Brave New World. During another break in 1989, guitarist Adrian Smith released a solo album with his band ASAP, entitled Silver and Gold, and vocalist Bruce Dickinson began work on a solo album with former Gillan guitarist Janick Gers, releasing Tattooed Millionaire in 1990, followed by a tour. At the same time, to mark the band's ten-year recording anniversary, Iron Maiden released a compilation collection, The First Ten Years, a series of ten CDs and double 12-inch singles. Between 24 February and 28 April 1990, the individual parts were released one-by-one, each containing two of Iron Maiden's singles, including the original B-sides. Soon afterwards, Iron Maiden regrouped to work on a new studio record. During the pre-production stages, Adrian Smith left the band due to differences with Steve Harris, regarding the direction the band should be taking, disagreeing with the \"stripped down\" style that they were leaning towards. Janick Gers, having worked on Dickinson's solo project, was chosen to replace Smith, and became the band's first new member in seven years. The album, No Prayer for the Dying, was released in October 1990, and contained \"Bring Your Daughter... to the Slaughter\", the band's first UK Singles Chart No. 1, originally recorded by Dickinson's solo outfit for the soundtrack to A Nightmare on Elm Street 5: The Dream Child. The song was banned by the BBC and only a 90-second live clip on Top of the Pops was shown. After another tour and some more time off, the band recorded their next studio album, Fear of the Dark, which was released in 1992 and included the stand-out title track, which is now a regular fixture in the band's concert setlists. Achieving their third No. 1 in the UK albums chart, the disc also featured the No. 2 single \"Be Quick or Be Dead\" and the No. 21 single \"From Here to Eternity\". The album featured the first songwriting by Gers, and no collaboration at all between Harris and Dickinson on songs. The extensive worldwide tour that followed included their first ever Latin American leg , and headlining the Monsters of Rock festivals in seven European countries. Iron Maiden's second performance at Donington Park, to an audience of 68,500 , was filmed for the audio and video release, Live at Donington, and featured a guest appearance by Adrian Smith, who joined the band to perform \"Running Free\".In 1993, Dickinson left the band to further pursue his solo career, but agreed to remain for a farewell tour and two live albums . The first, A Real Live One, featured songs from 1986 to 1992, and was released in March 1993. The second, A Real Dead One, featured songs from 1980 to 1984, and was released after Dickinson had left the band. The tour did not go well, with Steve Harris claiming that Dickinson would only perform properly for high-profile shows, and that at several concerts, he would only mumble into the microphone. Dickinson denied that he was under-performing, stating that it was impossible to \"make like Mr Happy Face if the vibe wasn't right\", saying that news of his exit from the band had prevented any chance of a good atmosphere during the tour. He played his farewell show with Iron Maiden on 28 August 1993, which was filmed, broadcast by the BBC, and released on video under the name Raising Hell. In 1994, the band listened to hundreds of tapes sent in by vocalists before convincing Blaze Bayley, formerly of the band Wolfsbane, who had supported Iron Maiden in 1990, to audition for them. Harris' preferred choice from the outset, Bayley had a different vocal style from his predecessor, which ultimately received a mixed reception among fans.After a two-year hiatus , Iron Maiden returned in 1995. Releasing their next studio album, The X Factor, the band had their lowest chart position since 1981 for an album in the UK , although it would go on to win Album of the Year awards in France and Germany. The record included the 11-minute epic \"Sign of the Cross\", the band's longest song since \"Rime of the Ancient Mariner\", as well as the singles, \"Man on the Edge\", based on the film Falling Down, and \"Lord of the Flies\", based on the novel of the same name. The release is notable for its \"dark\" tone, inspired by Steve Harris' divorce. The band toured for the rest of 1995 and 1996, playing for the first time in Israel and South Africa, and ending in the Americas. After the tour, Iron Maiden released a compilation album, Best of the Beast. The band's first compilation, it included a new single, \"Virus\", in which the lyrics attack the critics, who had recently written off the band.In 1998, Iron Maiden released Virtual XI, whose chart scores were the band's lowest to date, failing to score one million worldwide sales for the first time in the band's history. The album peaked at No. 16 in the UK; the band's lowest for a new studio record. At the same time, Steve Harris assisted in remastering the band's entire discography, up to and including Live at Donington .Bayley's tenure in Iron Maiden ended in January 1999 when he was asked to leave during a band meeting. The dismissal took place due to issues Bayley had experienced with his voice during the Virtual XI World Tour, although Janick Gers stated that this was partly the band's fault for forcing him to perform songs pitched outside the natural range of his voice. While the group were considering a replacement for Bayley, Rod Smallwood convinced Steve Harris to invite Bruce Dickinson back into the band. Although Harris admitted that he \"wasn't really into it\" at first, he then thought, \"'Well, if the change happens, who should we get?' The thing is, we know Bruce and we know what he's capable of, and you think, 'Well, better the devil you know.' I mean, we got on well professionally for, like, eleven years, and so ... after I thought about it, I didn't really have a problem with it.\"The band entered into talks with Dickinson, who agreed to rejoin during a meeting in Brighton in January 1999, along with guitarist Adrian Smith, who was telephoned a few hours later. With Gers, Smith's replacement, remaining, Iron Maiden now had a three-guitar line-up, and embarked on a hugely successful reunion tour. Dubbed The Ed Hunter Tour, it tied in with the band's newly released greatest hits collection, Ed Hunter, whose track listing was decided by a poll on the group's website, and also contained a computer game of the same name starring the band's mascot.One of Dickinson's primary concerns on rejoining the group \"was whether we would in fact be making a real state-of-the-art record and not just a comeback album,\" which eventually took the form of 2000's Brave New World. Having disliked the results from Harris' personal studio, Barnyard Studios located on his property in Essex, which had been used for the last four Iron Maiden studio albums, the band recorded the new release at Guillaume Tell Studios in Paris, France in November 1999 with producer Kevin Shirley. Thematic influences continued with \"The Wicker Man\" – based on the 1973 British cult film of the same name – and \"Brave New World\" – title taken from the Aldous Huxley novel of the same name. The album furthered the more progressive and melodic sound present in some earlier recordings, with elaborate song structures and keyboard orchestration.The world tour that followed consisted of well over 100 dates and culminated on 19 January 2001 in a show at the Rock in Rio festival in Brazil, where Iron Maiden played to an audience of around 250,000. While the performance was being produced for a CD and DVD release in March 2002, under the name Rock in Rio, the band took a year off from touring, during which they played three consecutive shows at Brixton Academy in aid of former drummer Clive Burr, who had recently announced that he had been diagnosed with multiple sclerosis. The band performed two further concerts for Burr's MS Trust Fund charity in 2005, and 2007, before his death in 2013. Following their Give Me Ed... 'Til I'm Dead Tour in the summer of 2003, Iron Maiden released Dance of Death, their thirteenth studio album, which was met by worldwide critical and commercial success. Produced by Kevin Shirley, now the band's regular producer, many critics also felt that this release matched up to their earlier efforts, such as Killers, Piece of Mind and The Number of the Beast. As usual, historical, and literary references were present, with \"Montségur\" in particular being about the Cathar stronghold conquered in 1244, and \"Paschendale\" relating to the significant battle which took place during the First World War. During the following tour, the band's performance at Westfalenhalle, in Dortmund, Germany, was recorded and released in August 2005 as a live album and DVD, entitled Death on the Road.In 2005, the band announced the Eddie Rips Up the World Tour, which, tying in with their 2004 DVD entitled The History of Iron Maiden – Part 1: The Early Days, only featured material from their first four albums. As part of this celebration of their earlier years, \"The Number of the Beast\" single was re-released and went straight to No. 3 in the UK Chart. The tour included many headlining stadium and festival dates, including a performance at Ullevi Stadium in Sweden to an audience of almost 60,000. This concert was also broadcast live on satellite television all over Europe to approximately 60 million viewers. Following this run of European shows, the band co-headlined the US festival tour, Ozzfest, with Black Sabbath, their final performance at which earned international press coverage after their show was sabotaged by singer Ozzy Osbourne's family, who took offence to Dickinson's remarks against reality-TV. The band completed the tour by headlining the Reading and Leeds Festivals on the 26–28 August, and the RDS Stadium in Ireland on 31 August. For the second time, the band played a charity show for The Clive Burr MS Trust Fund, which took place at the Hammersmith Apollo. The same year, the band were inducted into the Hollywood RockWalk in Sunset Boulevard, Los Angeles. At the end of 2005, Iron Maiden began work on A Matter of Life and Death, their fourteenth studio album, released in autumn 2006. While not a concept album, war and religion are recurring themes in the lyrics, as well as in the cover artwork. The release was a critical and commercial success, earning the band their first top ten in the Billboard 200 and receiving the Album of the Year award at the 2006 Classic Rock Roll of Honour Awards. A supporting tour followed, during which they played the album in its entirety; response to this was mixed.The second part of the \"A Matter of Life and Death\" tour, which took place in 2007, was dubbed \"A Matter of the Beast\" to celebrate the 25th anniversary of The Number of the Beast album, and included appearances at several major festivals worldwide. The tour opened in the Middle East with the band's first performance in Dubai at the Dubai Desert Rock Festival, after which they played to over 30,000 people at the Bangalore Palace Grounds, marking the first concert by any major heavy metal band in the Indian sub-continent. The band went on to play a string of European dates, including an appearance at Download Festival, their fourth headline performance at Donington Park, to approximately 80,000 people. On 24 June they ended the tour with a performance at London's Brixton Academy in aid of The Clive Burr MS Trust fund. On 5 September 2007, the band announced their Somewhere Back in Time World Tour, which tied in with the DVD release of their Live After Death album. The setlist for the tour consisted of successes from the 1980s, with a specific emphasis on the Powerslave era for set design. The first part of the tour, commencing in Mumbai, India on 1 February 2008, consisted of 24 concerts in 21 cities, travelling nearly 50,000 miles in the band's own chartered aeroplane, named \"Ed Force One\". They played their first ever concerts in Costa Rica and Colombia and their first shows in Australia and Puerto Rico since 1992. The tour led to the release of a new compilation album, entitled Somewhere Back in Time, which included a selection of tracks from their 1980 eponymous debut to 1988's Seventh Son of a Seventh Son, as well as several live versions from Live After Death.The Somewhere Back in Time World Tour continued with two further legs in the US and Europe in the summer of 2008, during which the band used a more expansive stage-set, including further elements of the original Live After Death show. With the sole UK concert taking place at Twickenham Stadium, this would be the first time the band would headline a stadium in their own country. The three 2008 legs of the tour were remarkably successful; it was the second highest-grossing tour of the year for a British artist.The last part of the tour took place in February and March 2009, with the band, once again, using \"Ed Force One\". The final leg included the band's first ever appearances in Peru and Ecuador, as well as their return to Venezuela and New Zealand after 17 years. The band also played another show in India at the Rock in India festival to a crowd of 20,000. At their concert in São Paulo on 15 March, Dickinson announced on stage that it was the largest non-festival show of their career, with an overall attendance of 63,000 people. The final leg ended in Florida on 2 April after which the band took a break. Overall, the tour reportedly had an attendance of over two million people worldwide over both years. At the 2009 Brit Awards, Iron Maiden won the award for best British live act. Voted for by the public, the band reportedly won by a landslide.On 20 January 2009, the band announced that they were to release a full-length documentary film in select cinemas on 21 April 2009. Entitled Iron Maiden: Flight 666, it was filmed during the first part of the Somewhere Back in Time World Tour between February and March 2008. Flight 666 was co-produced by Banger Productions and was distributed in cinemas by Arts Alliance Media and EMI, with D&E Entertainment sub-distributing in the US. The film went on to have a Blu-ray, DVD, and CD release in May and June, topping the music DVD charts in 22 countries. Following announcements that the band had begun composition of new material and booked studio time in early 2010 with Kevin Shirley producing, The Final Frontier was announced on 4 March. The album, the band's fifteenth, was released on 16 August, garnering critical acclaim and the band's greatest commercial success in their history, reaching No. 1 in twenty-eight countries worldwide. Although Steve Harris had been quoted in the past as claiming that the band would only produce fifteen studio releases, band members have since confirmed that there will be at least one further record. The album's supporting tour saw the band perform 98 shows across the globe to an estimated audience of over 2 million, including their first visits to Singapore, Indonesia, and South Korea, before concluding in London on 6 August 2011. As the tour's 2010 leg preceded The Final Frontier's release, the band made \"El Dorado\" available as a free download on 8 June, which would go on to win the award for Best Metal Performance at the 2011 Grammy Awards on 13 February 2011. It was the band's first win following two previous Grammy nominations .On 15 March, a new compilation to accompany 2009's Somewhere Back in Time was announced. Entitled From Fear to Eternity, the original release date was set at 23 May, but was later delayed to 6 June. The double disc set covers the period 1990–2010 , and, as on Somewhere Back in Time, live versions with Bruce Dickinson were included in place of original recordings which featured other vocalists, in this case Blaze Bayley. In a press release regarding From Fear to Eternity, band manager Rod Smallwood revealed that Iron Maiden would release a new concert video to DVD in 2011, filmed in Santiago, Chile and Buenos Aires, Argentina during The Final Frontier World Tour. On 17 January 2012, the band announced that the new release, entitled En Vivo!, based on footage from the Chile concert, would be made available worldwide on CD, LP, DVD, and Blu-ray on 26 March, except for the United States and Canada . In addition to the concert footage, the video release includes an 88-minute tour documentary, entitled Behind The Beast, containing interviews with the band and their crew. In December 2012, one song from the release was nominated for a Grammy Award for Best Hard Rock/Metal Performance at the 2013 Grammy Awards.On 15 February 2012, the band announced the Maiden England World Tour 2012–14, which was based around the video of the same name. The tour commenced in North America in the summer of 2012 and was followed by further dates in 2013 and 2014, which included the band's record-breaking fifth headline performance at Donington Park, their first show at the newly built national stadium in Stockholm, a return to the Rock in Rio festival in Brazil, and their debut appearance in Paraguay. In August 2012, Steve Harris stated that the Maiden England video would be re-issued in 2013, with a release date later set for 25 March 2013 in DVD, CD, and LP formats under the title Maiden England '88. Following confirmation from the group that 2010's The Final Frontier would not be their last album, Bruce Dickinson revealed plans for a sixteenth studio record in July 2013, with a potential release date in 2015. In February 2015, drummer Nicko McBrain revealed that a new album had been completed, although the release was put on hold as Dickinson was recovering from treatment for a cancerous tumour found on his tongue. On 15 May, after Dickinson was cleared for activities, manager Rod Smallwood confirmed that the album would be released in 2015, although the band would not tour until 2016 to allow Dickinson to continue recuperating. On 18 June 2015, the band's website announced its title, The Book of Souls, and confirmed a release date of 4 September 2015. It is the band's first original studio album not to be issued by EMI outside North America, following Parlophone's acquisition by Warner Music Group in 2013. It was a critical and commercial success, becoming the band's fifth UK No. 1 album. The new record was recorded at Guillaume Tell Studios, Paris, which they had previously used for 2000's Brave New World, with regular producer Kevin Shirley in late summer 2014. With a total run time of 92 minutes, it is the group's first double studio album. In addition, the release's closing song, \"Empire of the Clouds\", penned by Dickinson, surpassed \"Rime of the Ancient Mariner\" as Iron Maiden's longest song, at 18 minutes in length. A music video for the song \"Speed of Light\" was issued on 14 August.In February 2016, the band embarked on The Book of Souls World Tour, which saw them play concerts in 35 countries in North and South America, Asia, Australasia, Africa, and Europe, including their first ever performances in China, El Salvador, and Lithuania. As with 2008–09's Somewhere Back in Time World Tour and 2010–11's The Final Frontier World Tour, the group travelled in a customised aeroplane, flown by Dickinson and nicknamed \"Ed Force One\", although they used a Boeing 747-400 jumbo jet. The band completed the tour in 2017 with further European and North American shows. On 20 September 2017, The Book of Souls: Live Chapter was announced. Recorded throughout The Book of Souls World Tour, it was released on 17 November 2017.In the summer of 2016, the group launched a mobile game, Iron Maiden: Legacy of the Beast and a pinball game with the same name in 2018. Inspired by the game's title, the band would undertake the Legacy of the Beast World Tour, commencing in Europe in 2018, with North and South American shows following in 2019. On 23 September 2019, the band announced they would play the 2020 Belsonic Festival in Belfast and a headline show at Donington Park, England, as part of 2020 Download Festival. On 7 November 2019, they announced Australian shows throughout May 2020 joined by Killswitch Engage. Iron Maiden were ranked No. 24 in VH1's \"100 Greatest Artists of Hard Rock\", No. 4 in MTV's \"Top 10 Greatest Heavy Metal Bands of All Time\" and No. 3 in VH1 Classic's \"Top 20 Metal Bands\". The band also won the Ivor Novello Award for international achievement in 2002 and were inducted into the Hollywood RockWalk whilst touring in the US in 2005.Iron Maiden frequently use the slogan \"Up the Irons\" in their disc liner notes, and the phrase can also be seen on several T-shirts officially licensed by the band. It is a paraphrase of \"Up the Hammers\", the phrase which refers to the London football club, West Ham United, of which founder Steve Harris is a fan. Iron Maiden's mascot, Eddie, is a perennial fixture in the band's science fiction and horror-influenced album cover art, as well as in live shows. Originally a papier-mâché mask incorporated in their backdrop which would squirt fake blood during their live shows, the name would be transferred to the character featured in the band's debut album cover, created by Derek Riggs. Eddie was painted exclusively by Riggs until 1992, at which point the band began using artwork from numerous other artists as well, including Melvyn Grant. Eddie is also featured in the band's first-person shooter video game, Ed Hunter, as well as their mobile role-playing game, Iron Maiden: Legacy of the Beast, in addition to numerous T-shirts, posters and other band-related merchandise. In 2008, he was awarded the \"Icon Award\" at the Metal Hammer Golden Gods, while Gibson.com describes him as \"the most recognisable metal icon in the world and one of the most versatile too\".Iron Maiden's distinct logo has adorned all of the band's releases since their debut, 1979's The Soundhouse Tapes EP. The typeface originates with Vic Fair's poster design for the 1976 science fiction film, The Man Who Fell to Earth, also used by Gordon Giltrap, although Steve Harris claims that he designed it himself, using his abilities as an architectural draughtsman. The song \"Always Look on the Bright Side of Life\" is a staple at their concerts, where the recording is played after the final encore.In May 2019, the band filed a $2 million lawsuit against video game company 3D Realms for infringing on their trademark via the planned release of a game called Ion Maiden, which the band claims “is nearly identical to the Iron Maiden trademark in appearance, sound and overall commercial impression.” The suit further accuses 3D Realms of causing “confusion among consumers” by depicting a skull icon similar to the band's Eddie mascot and that Ion Maiden is similar to the band's own Legacy of the Beast video game. According to Guitar World, Iron Maiden's music has \"influenced generations of newer metal acts, from legends like Metallica to current stars like Avenged Sevenfold,\" with Metallica drummer Lars Ulrich commenting that he has \"always had an incredible amount of respect and admiration for them.\" Kerry King of Slayer stated that \"they meant so much to [him] in their early days\" and Scott Ian of Anthrax said that \"they had a major impact on [his] life.\"M. Shadows of Avenged Sevenfold stated that Iron Maiden \"are by far the best live band in the world and their music is timeless\", while Trivium singer Matt Heafy comments that \"without Iron Maiden, Trivium surely wouldn't exist\". Slipknot and Stone Sour frontman Corey Taylor said that \"Steve Harris does more with four fingers than I've ever seen anybody do. And Bruce Dickinson? Dude! To me, he was the quintessential old-school heavy metal singer. He could hit notes that were just sick, and he was a great showman. Everything made me a fan. And there wasn't a dude that I hung out with that wasn't trying to draw Eddie on their schoolbooks\", while their music also helped Jesper Strömblad of In Flames to pioneer the melodic death metal genre, stating that he had wanted to combine death metal with Iron Maiden's melodic guitar sounds.Other heavy metal artists who cite the band as an influence include Chris Jericho, a WWE wrestler and lead singer of Fozzy, Cam Pipes, lead vocalist of 3 Inches of Blood, Vitaly Dubinin, bassist of Aria, Mikael Åkerfeldt, guitarist and lead vocalist of Opeth, and X Japan drummer Yoshiki and former guitarist hide. Both current and former Dream Theater members John Petrucci, John Myung, and Mike Portnoy have stated that Iron Maiden were one of their biggest influences when their band first formed. The band's name has been mentioned prominently in several songs, such as the singles \"Teenage Dirtbag\" by Wheatus, \"Back to the 80's\" by Danish dance-pop band Aqua. and \"Fat Lip\" by Sum 41. Iron Maiden have also been referenced in Weezer's \"Heart Songs\" , Blues Traveler's \"Psycho Joe\" , and NOFX's \"Eddie, Bruce and Paul\" , which Sputnikmusic describes as \"a humorous retelling of Paul DiAnno's departure\".In 2008, Kerrang! released Maiden Heaven: A Tribute to Iron Maiden, an album composed of Iron Maiden cover songs performed by Metallica, Machine Head, Dream Theater, Trivium, Coheed and Cambria, Avenged Sevenfold, and other groups influenced by the band. In 2010, Maiden uniteD, an acoustic tribute band consisting of members of Ayreon, Threshold and Within Temptation, released Mind the Acoustic Pieces, a re-interpretation of the entire Piece of Mind album. Many other Iron Maiden cover albums exist , including piano, electro, string quartet and hip-hop tributes.Iron Maiden songs have been featured in the soundtracks of several video games, including Carmageddon 2, Grand Theft Auto: Vice City, Grand Theft Auto: Episodes from Liberty City, Grand Theft Auto IV: The Lost and Damned, Tony Hawk's Pro Skater 4, SSX on Tour and Madden NFL 10. Their music also appears in the Guitar Hero and Rock Band series of rhythmic video games. Iron Maiden songs have also appeared in films, such as Phenomena , and Murder by Numbers; while MTV's animated duo Beavis and Butt-Head have commented favourably on the band several times.Transformers author Bill Forster is an avowed Iron Maiden fan and made several Iron Maiden references, including song lyrics and the phrase \"Up the Irons\" in his books, including The Ark series and The AllSpark Almanac series. In 1982, the band released one of their most popular, controversial and acclaimed albums, The Number of the Beast. The artwork and title track led to Christian groups in the United States branding the band as Satanists, encouraging people to destroy copies of the release. The band's manager, Rod Smallwood, later commented that Christians initially burnt the records, but later decided to destroy them with hammers through fear of breathing in the melting vinyl's fumes. The protests were not restricted to the US, with Christian organisations preventing Iron Maiden from performing in Chile in 1992.Contrary to the accusations, the band have always denied the notion that they are Satanists, with lead vocalist, Bruce Dickinson, doing so on-stage in the Live After Death concert video. Steve Harris has since commented that, \"It was mad. They completely got the wrong end of the stick. They obviously hadn't read the lyrics. They just wanted to believe all that rubbish about us being Satanists.\" Harris has also stated that \"The Number of the Beast\" song was inspired by a nightmare he had after watching Damien: Omen II, and also influenced by Robert Burns' Tam o' Shanter. Furthermore, the band's drummer, Nicko McBrain, has been a born-again Christian since 1999. For their Somewhere Back in Time World Tour in 2008 and 2009, Iron Maiden commissioned an Astraeus Airlines Boeing 757 as transport. The aeroplane was converted into a combi configuration, which enabled it to carry the band, their crew and stage production, thereby allowing the group to perform in countries which were previously deemed unreachable logistically. It was also repainted with a special Iron Maiden livery, which the airline decided to retain after receiving positive feedback from customers. The aircraft, named \"Ed Force One\" after a competition on the band's website, was flown by Dickinson, as he was also a commercial airline pilot for Astraeus, and plays a major role in the award-winning documentary, Iron Maiden: Flight 666, which was released in cinemas in 42 countries in April 2009. A different aeroplane was used for The Final Frontier World Tour in 2011 with altered livery, adopting the artwork of The Final Frontier album, and features heavily in the 2012 documentary \"Behind the Beast\". For The Book of Souls World Tour in 2016, the band upgraded to an ex-Air France Boeing 747-400 jumbo jet, supplied by Air Atlanta Icelandic and customised by Volga-Dnepr Gulf, which allows for more space without the aircraft having to undergo a significant conversion to carry their equipment. Steve Harris, Iron Maiden's bassist and primary songwriter, has stated that his influences include Black Sabbath, Deep Purple, Led Zeppelin, Uriah Heep, Pink Floyd, Genesis, Yes, Jethro Tull, Thin Lizzy, UFO, Queen and Wishbone Ash. In 2010 Harris stated, \"I think if anyone wants to understand Maiden's early thing, in particular the harmony guitars, all they have to do is listen to Wishbone Ash's Argus album. Thin Lizzy too, but not as much. And then we wanted to have a bit of a prog thing thrown in as well, because I was really into bands like Genesis and Jethro Tull. So you combine all that with the heavy riffs and the speed, and you've got it.\" In 2004, Harris explained that the band's \"heaviness\" was inspired by \"Black Sabbath and Deep Purple with a bit of Zeppelin thrown in.\" On top of this, Harris developed his own playing style, which guitarist Janick Gers describes as \"more like a rhythm guitar,\" cited as responsible for the band's galloping style, heard in such songs as \"The Trooper\" and \"Run to the Hills.\"The band's guitarists, Dave Murray, Adrian Smith, and Janick Gers, each have their own individual influences and playing style. Dave Murray is known for his legato technique which, he claims, \"evolved naturally. I'd heard Jimi Hendrix using legato when I was growing up, and I liked that style of playing.\" Stating that he \"was inspired by blues rock rather than metal,\" Adrian Smith was influenced by Johnny Winter and Pat Travers, leading to him becoming a \"melodic player.\" Janick Gers, on the other hand, prefers a more improvised style, largely inspired by Ritchie Blackmore, which he claims is in contrast to Smith's \"rhythmic\" sound.Singer Bruce Dickinson, who typically works in collaboration with guitarist Adrian Smith, has an operatic vocal style, inspired by Arthur Brown, Peter Hammill, Ian Anderson and Ian Gillan, and is often considered to be one of the best heavy metal vocalists of all time. Although Nicko McBrain has only received one writing credit, on the Dance of Death album, Harris often relies on him while developing songs. Adrian Smith commented, \"Steve loves playing with him. [They] used to work for hours going over these bass and drum patterns.\"Throughout their career, the band's style has remained largely unchanged, in spite of the addition of guitar synthesisers on 1986's Somewhere in Time, keyboards on 1988's Seventh Son of a Seventh Son, and an attempt to return to the \"stripped down\" production of their earlier material on 1990's No Prayer for the Dying. In recent years, however, the band have begun using more progressive elements in their songs, which Steve Harris describes as not progressive \"in the modern sense, but like Dream Theater, more in a 70s way\". According to Harris, Seventh Son of a Seventh Son was the band's first album which was \"more progressive\", while they would only return to this style from 1995's The X Factor, which he states is \"like an extension of Seventh Son..., in the sense of the progressive element to it\". The development contrasts with the band's raw-sounding earlier material, which AllMusic states was \"clearly drawing from elements of punk rock\", although Harris firmly denies this. Iron Maiden Killers The Number of the Beast Piece of Mind Powerslave Somewhere in Time Seventh Son of a Seventh Son No Prayer for the Dying Fear of the Dark The X Factor Virtual XI Brave New World Dance of Death A Matter of Life and Death The Final Frontier The Book of Souls List of artists who reached number one on the UK Singles Chart List of new wave of British heavy metal bands List of bands and artists from England List of songs recorded by Iron Maiden List of Iron Maiden tribute albums The Iron Maidens Bushell, Gary . Iron Maiden: Running Free. Hal Leonard Corp. ISBN 978-0-946-39184-4. Daniels, Neil . Iron Maiden - Updated Edition: The Ultimate Illustrated History of the Beast. Voyageur Press. ISBN 978-0-760-35167-3. Di'Anno, Paul . The Beast: Singing With Iron Maiden―The Drugs, the Groupies . . . the Whole Story. John Blake. ISBN 978-1-844-54884-2. Dickinson, Bruce . What Does This Button Do?: An Autobiography. Dey Street Books. ISBN 978-0-062-46813-0. Halfin, Ross . Iron Maiden. Vision On. ISBN 978-1-846-09445-3. McMurtrie, John . Iron Maiden: On Board Flight 666. Orion Publishing. ISBN 978-1-409-14136-5. Popoff, Martin . 2 Minutes to Midnight: An Iron Maiden Day-by-Day. Backbeat Books. ISBN 978-1-617-13565-1. Prato, Greg . Iron Maiden: '80 '81. self-published. ISBN 978-1-508-53638-3. Official website","sentences":[{"text":"Iron Maiden are an English heavy metal band formed in Leyton, East London, in 1975 by bassist and primary songwriter Steve Harris.","keywords":["Iron Maiden","East London","English heavy metal band","Leyton","bassist","primary songwriter Steve Harris"],"images":["https://images-na.ssl-images-amazon.com/images/I/81J4jpxoScL._SL1500_.jpg","https://www.angrymetalguy.com/wp-content/uploads/2020/01/Iron-Maiden-Iron-Maiden-01.jpg"],"googleSearchQuery":"Iron Maiden Iron Maiden"},{"text":"The band's discography has grown to 39 albums, including 16 studio albums, 12 live albums, four EPs, and seven compilations.","keywords":["band's discography","studio albums","live albums","albums","compilations","EPs"],"images":["https://upload.wikimedia.org/wikipedia/commons/0/0d/Iron_Maiden_in_the_Palais_Omnisports_of_Paris-Bercy_%28France%29.jpg","https://assets.isu.pub/document-structure/191217142752-99900fb81bddbb9efda32e2673598634/v1/4ee94cccb8b68846d80e0c348a21db8a.jpg"],"googleSearchQuery":"Iron Maiden band's discography"},{"text":"Pioneers of the new wave of British heavy metal, Iron Maiden achieved initial success during the early 1980s.","keywords":["Iron Maiden","initial success","Pioneers of the new wave of British heavy metal","early 1980s"],"images":["https://images-na.ssl-images-amazon.com/images/I/81J4jpxoScL._SL1500_.jpg","https://www.angrymetalguy.com/wp-content/uploads/2020/01/Iron-Maiden-Iron-Maiden-01.jpg"],"googleSearchQuery":"Iron Maiden Iron Maiden"},{"text":"After several line-up changes, the band went on to release a series of UK and US platinum and gold albums, including 1982's The Number of the Beast, 1983's Piece of Mind, 1984's Powerslave, 1985's live release Live After Death, 1986's Somewhere in Time, and 1988's Seventh Son of a Seventh Son.","keywords":["gold albums","live release Live After Death","line-up changes","series of UK","US platinum","Number of the Beast","band","Piece of Mind","1984's Powerslave","1988's Seventh Son of a Seventh Son","1985's","1986's","Time"],"images":["https://upload.wikimedia.org/wikipedia/commons/0/0d/Iron_Maiden_in_the_Palais_Omnisports_of_Paris-Bercy_%28France%29.jpg","https://goldrecordoutlet.com/wp-content/uploads/2019/11/Iron-Maiden-Piece-of-Mind.jpg"],"googleSearchQuery":"Iron Maiden gold albums"},{"text":"Since the return of lead vocalist Bruce Dickinson and guitarist Adrian Smith in 1999, the band has undergone a resurgence in popularity, with a series of new albums and tours.","keywords":["return of lead vocalist Bruce Dickinson","guitarist Adrian Smith","band","resurgence","popularity","tours","series of new albums"],"images":["https://arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/7UFRERZBQZD6PHBWWJKFVONF4U.jpg","https://www.thesun.co.uk/wp-content/uploads/2019/11/shutterstock_editorial_9707628af-e1572767366456.jpg"],"googleSearchQuery":"Iron Maiden return of lead vocalist Bruce Dickinson"},{"text":"Their 2010 studio offering, The Final Frontier, peaked at No. 1 in 28 countries and received widespread critical acclaim.","keywords":["studio offering","Final Frontier","widespread critical acclaim","countries"],"images":["https://i.redd.it/so0gtp8yam331.jpg","http://www.gratefulweb.com/sites/default/files/images/articles/unnamed%286%29_6.jpg"],"googleSearchQuery":"Iron Maiden studio offering"},{"text":"The sixteenth studio album, The Book of Souls, was released on 4 September 2015 and debuted at number one in the album charts of 43 countries","keywords":["sixteenth studio album","album charts","Book of Souls","September","number","countries"],"images":["https://upload.wikimedia.org/wikipedia/commons/0/0d/Iron_Maiden_in_the_Palais_Omnisports_of_Paris-Bercy_%28France%29.jpg","https://metaltothemasses.files.wordpress.com/2015/09/img_4615.jpg"],"googleSearchQuery":"Iron Maiden sixteenth studio album"}],"downloadedImages":[]}